app/Controllers/Auth.php


        // Validation passed, check authentication
        $db = \Config\Database::connect();
        $user = $db->table('users')
                   ->where('email', $this->request->getVar('email'))
                   ->get()
                   ->getRow();
---
SELECT *
FROM `users`
WHERE `email` = 'ryukee@gmail.com'
 LIMIT 1